share/tutorials/incompressible/dym-pimple/wing_motion/wing_motion_2d_simple/0.org/omega
// mousse: CFD toolbox

FoamFile
{
  version     2.0;
  format      ascii;
  class       volScalarField;
  object      epsilon;
}

#include        "include/initialConditions"
dimensions      [0 0 -1 0 0 0 0];
internalField   uniform $turbulentOmega;

boundaryField
{
  #include "include/fixedInlet"
  outlet
  {
    type            inletOutlet;
    inletValue      $internalField;
    value           $internalField;
  }
  wing
  {
    type            omegaWallFunction;
    value           $internalField;
  }
  #include "include/frontBackTopBottomPatches"
}

// vim: set ft=foam et sw=2 ts=2 sts=2:
