share/tutorials/incompressible/dym-pimple/wing_motion/wing_motion_2d_simple/0.org/p
// mousse: CFD toolbox

FoamFile
{
  version     2.0;
  format      ascii;
  class       volScalarField;
  object      p;
}

#include        "include/initialConditions"
dimensions      [0 2 -2 0 0 0 0];
internalField   uniform $pressure;

boundaryField
{
  inlet
  {
    type            zeroGradient;
  }
  outlet
  {
    type            fixedValue;
    value           $internalField;
  }
  wing
  {
    type            zeroGradient;
  }
  #include "include/frontBackTopBottomPatches"
}

// vim: set ft=foam et sw=2 ts=2 sts=2:
