share/tutorials/incompressible/dym-pimple/wing_motion/wing_motion_2d_simple/constant/transportProperties
// mousse: CFD toolbox

FoamFile
{
  version     2.0;
  format      ascii;
  class       dictionary;
  object      transportProperties;
}

transportModel Newtonian;
nu              [0 2 -1 0 0 0 0] 1e-05;

// vim: set ft=foam et sw=2 ts=2 sts=2:
