share/tutorials/incompressible/dym-pimple/wing_motion/wing_motion_2d_simple/system/extrudeMeshDict
// mousse: CFD toolbox

FoamFile
{
  version     2.0;
  format      ascii;
  class       dictionary;
  object      extrudeMeshDict;
}

// What to extrude:
//      patch   : from patch of another case ('sourceCase')
//      mesh    : as above but with original case included
//      surface : from externally read surface
constructFrom patch;
sourceCase "../wingMotion_snappyHexMesh";
sourcePatches (symFront);
// If construct from patch: patch to use for back (can be same as sourcePatch)
exposedPatchName symBack;
// Flip surface normals before usage. Valid only for extrude from surface or
// patch.
flipNormals false;
//- Linear extrusion in point-normal direction
extrudeModel        linearNormal;
nLayers             1;
expansionRatio      1.0;
linearNormalCoeffs
{
  thickness       0.05;
}
// Do front and back need to be merged? Usually only makes sense for 360
// degree wedges.
mergeFaces false;   //true;
// Merge small edges. Fraction of bounding box.
mergeTol 0;

// vim: set ft=foam et sw=2 ts=2 sts=2:
